Tekla Open API Reference for Tekla Structures 2025
Events.ClipPlaneChangedDelegate Delegate
 The delegate to use for clip plane events.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public delegate void ClipPlaneChangedDelegate(
	int viewId,
	int clipPlaneId,
	ChangeData.ChangeTypeEnum operation
)
Public Delegate Sub ClipPlaneChangedDelegate (
	viewId As Integer,
	clipPlaneId As Integer,
	operation As ChangeData.ChangeTypeEnum
)
Parameters
viewId
Type: System.Int32
The view id of the clip plane.
clipPlaneId
Type: System.Int32
The clip plane id.
operation
Type: Tekla.Structures.Model.ChangeData.ChangeTypeEnum
insert/modify/delete
See Also
Reference
Tekla.Structures.Model Namespace